In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {
    'data':['ohio', 'ohip', 'ahiq'],
    'year':[2001, 2002, 2003],
    'pop':[1.5, 1.7, 1.8]
}
frame = DataFrame(data)
frame

   data  year  pop
0  ohio  2001  1.5
1  ohip  2002  1.7
2  ahiq  2003  1.8

In [3]:
frame.head()

   data  year  pop
0  ohio  2001  1.5
1  ohip  2002  1.7
2  ahiq  2003  1.8

In [5]:
data = {
    'data':['ohio', 'ohip', 'ahiq'],
    'year':[2001, 2002, 2003],
    'pop':[1.5, 1.7, 1.8]
}
frame2 = DataFrame(data)
frame2

   data  year  pop
0  ohio  2001  1.5
1  ohip  2002  1.7
2  ahiq  2003  1.8

In [6]:
# 使用columns来进行排序
pd.DataFrame(data, columns=['year', 'data', 'pop'])

   year  data  pop
0  2001  ohio  1.5
1  2002  ohip  1.7
2  2003  ahiq  1.8

In [15]:
# 查找没有的值就出现缺失值会直接缺失填充啦
data3 = {
    'data':['ohio', 'ohip', 'ahiq'],
    'year':[2001, 2002, 2003],
    'pop':[1.5, 1.7, 1.8],
}

In [17]:
frame3 = DataFrame(data3, columns=['data', 'year', 'pop', 'debt'])
frame3

   data  year  pop debt
0  ohio  2001  1.5  NaN
1  ohip  2002  1.7  NaN
2  ahiq  2003  1.8  NaN

In [19]:
# 通过下标进行取值
frame3['year']

0    2001
1    2002
2    2003
Name: year, dtype: int64

In [21]:
frame3.year

0    2001
1    2002
2    2003
Name: year, dtype: int64

In [24]:
frame3.loc[2]  # 通过下标来进行取值啦

data    ahiq
year    2003
pop      1.8
debt     NaN
Name: 2, dtype: object

### END